Public Attributes | List of all members
API_SectionSegment Struct Reference
Element Manager API
Represents one segment of a section/elevation/interior elevation. More...
#include <APIdefs_Elements.h>
 Public Attributes
short  | linePen
Pen attribute index of the line.
short  | textPen
Pen attribute index of the text.
API_AttributeIndex  | ltypeInd
Line type attribute index.
short  | sectPen
Pen attribute index to be used in sections for contours (when not overridden by useElemPens).
short  | sectFillPen
Pen attribute index to be used in sections for fills (when not overridden by useElemPens)
short  | sectFillBGPen
Pen attribute index of the background fill of the cut elements (when not overridden by useElemPens)
short  | verticalRangeStoryBaseNumber
The story number to which vertMin and vertMax is relative to, when relativeToStory is true.
API_SegmentHorizontalRange  | horizRange
Horizontal range of the segment:
API_SegmentVerticalRange  | vertRange
Vertical range of the segment:
double  | markerSize
Marker size.
bool  | begMark
Put marker on the beginning point.
bool  | endMark
Put marker on the end point.
bool  | relativeToStory
Vertical limited range is relative to the home story or absolute to project zero.
bool  | useElemPens
Use the pens defined in the elements.
bool  | begLine
Show line at beginning point.
bool  | middleLine
Show line at midlle point.
bool  | endLine
Show line at end point.
double  | lineLength
Length of the line.
double  | vertMin
Vertical limitation - minimum height.
double  | vertMax
Vertical limitation - maximum height.
GS::uchar_t  | cutPlName [API_UniLongNameLen]
Name of the section as a Unicode string.
GS::uchar_t  | cutPlIdStr [API_UniLongNameLen]
The reference ID of the section in Unicode. If the text contains a '/' character, then the text is split between the beginning and end marks.
double  | textSize
Text size [mm] of marker text.
short  | font
Font attribute index for the marker text.
short  | effectBits
The settings of the 3D view. It can take the following values:
API_AttributeIndex  | shadFill
Fill attribute index of the shadow's fill.
short  | shadFillPen
Pen attribute index of the shadow's fill.
short  | shadFillBGPen
Background pen attribute index of the shadow's fill.
API_AttributeIndex  | limitLtypeInd
Line type of the horizontal limit line.
short  | limitLinePen
Line pen of the horizontal limit line.
bool  | continuous
Continuous if true, otherwise is segmented.
double  | sunAngXY
Custom sun azimuth relative to the cut plane.
double  | sunAngZ
Custom sun altitude relative to the cut plane.
API_Guid  | begMarkerId
Guid of the Section Marker object at the starting point of the section line.
API_Guid  | midMarkerId
Guid of the Section Marker object at the center point of the section line.
API_Guid  | endMarkerId
Guid of the Section Marker object at the end point of the section line.
bool  | modelUseElemPen
Use one pen for all elements in the Section/Elevation view.
bool  | distAreaUseElemPen
Use one pen for all elements in distant area of the Section/Elevation view.
short  | modelElemPen
Foreground pen of model uncut surface fill.
short  | distAreaElemPen
Pen attribute index of elements in distant area of the Section/Elevation view.
API_AttributeIndex  | distAreaShadFill
Fill attribute index for Shadow Polygons used in the Section/Elevation view.
short  | distAreaShadFillPen
Fill pen index for Shadow Polygons used in the Section/Elevation view.
short  | distAreaShadFillBGPen
Fill background pen index for Shadow Polygons used in the Section/Elevation view.
API_CutPlaneUncutSurfaceFillID  | distAreaUncutSurfFillType
The method for displaying fills of uncut surfaces in the distant area of the Section/Elevation (effective if distAreaUseUncutSurfFill is true)
short  | distAreaUncutSurfBGPen
Pencolor to apply to the fills of all uncut surfaces in the distant area of the Section/Elevation (if uniform pencolor is selected in the Distant Area Options).
bool  | distAreaUseUncutSurfFill
Apply fills to uncut surfaces displayed in the distant area of the Section/Elevation.
bool  | markedDistArea
Mark distant area.
API_CutPlaneUncutSurfaceFillID  | modelUncutSurfFillType
The method for displaying fills of uncut surfaces (Model Effects) of the Section/Elevation (effective if modelUseUncutSurfFill is true). See the API_CutPlaneUncutSurfaceFillID values at the distAreaUncutSurfFillType parameter.
short  | modelUncutSurfBGPen
Pencolor to apply to the fills of all uncut surfaces in the Section/Elevation (if uniform pencolor is selected in the Model Effects panel).
bool  | modelUseUncutSurfFill
Apply fills to uncut surfaces displayed in the Section/Elevation.
bool  | transparency
UInt32  | nMainCoord
Number of main line coordinates in memo.
UInt32  | nDistCoord
Number of marked distant area line coordinates in memo.
UInt32  | nDepthCoord
Number of depth line coordinates in memo.
bool  | drawingModeON
Section is in drawing mode.
bool  | windOpened
The section/elevation/interior elevation window is opened.
bool  | active
Turned off or active.
bool  | sourceMarker
Is this segment a source marker? (output only/no default)
API_DatabaseUnId  | databaseID
Database ID to switch to (see API_DatabaseUnId).
API_CutPlanePlanConn  | currPlanConn
Current plan connectivity (read only). Show the state of the Section/Elevation window. This member will pick up the value of intPlanConn when the Section/Elevation window was activated. The Section/Elevation will be regenerated from the model if it's necessary.
API_CutPlanePlanConn  | intPlanConn
Intended plan connectivity. Show the state of the element on the plan. It could be different from the state of its Section/Elevation window (currPlanConn).
bool  | solidOperationsOnZones
Use the solid operations on zones (for interior elevations only).
bool  | exclBlockWalls
Exclude view blocking walls (for interior elevations only).
bool  | showCutElements
Show cut elements (for interior elevations only).
bool  | byLimitLines
Relevant elems are detected only by limit lines (used only for Interior Elevation segments).
API_StoryHandleAppearance  | shAppearance
Options for displaying story lines on the Section/Elevation.
API_AttributeIndex  | shLineType
Line type index of the Story Level lines.
short  | shLinePen
Pencolor index of the Story Level lines.
short  | shMarkerPen
Pencolor index of the Story Handle Markers (effective when not overridden by shUseSymbolPens).
bool  | shUseSymbolPens
Use own colors of the Story Handle Marker object.
bool  | shLeftMarkerOn
Display the Story Handle Markers on the left side.
bool  | shRightMarkerOn
Display the Story Handle Markers on the right side.
bool  | shLineOn
Story handle line is on or off.
double  | shLeftMarkerOffset
The offset of the Story Level line beyond the limits of the Section/Elevation on the left side.
double  | shRightMarkerOffset
The offset of the Story Level line beyond the limits of the Section/Elevation on the right side.
API_Guid  | shSymbolId
The guid of the Story Handle Marker object element instance (API_ObjectType).
short  | shMarkerFont
The font index of the Story Handle Marker.
unsigned short  | shMarkerFaceBits
The text style of the Story Handle Marker.
double  | shMarkerTextSize
The text size of the Story Handle Marker in mm.
double  | shMarkerSize
The size of the Story Handle Marker in mm.
API_BoundaryDisplay  | boundaryDisplay
Boundary contour display mode. The possible values are: APIBound_UncutContours, APIBound_NoContours, and APIBound_OverrideContours.
short  | boundaryPen
Boundary contour pen.
API_AttributeIndex  | boundaryLineType
Boundary contour line type.
API_Sector  | iePolygonEdge
Used for link the segment to an edge of the Interior Elevation.
double  | ieCreationSegmentHorizontalOffset
Used only for Interior Elevation creation.
double  | ieCreationSegmentDepth
Used only for Interior Elevation creation.
Detailed Description
Represents one segment of a section/elevation/interior elevation.
Remarks
Refer to the ACAPI_Database_ChangeCurrentDatabase function to access and operate on the corresponding Section/Elevation/Interior Elevation database. For cut plane element related memo data see the ACAPI_Element_GetMemo function. You can retrieve the Section Marker and the Story Handle Marker objects with the ACAPI_Element_Get and ACAPI_Element_GetMemo functions applying the corresponding marker indices stored in API_CutPlaneType, but you cannot create or modify them directly. You can define and change marker objects only together with the cut plane element using ACAPI_Element_CreateExt and ACAPI_Element_ChangeExt respectively. You can access to the default settings of the markers with the ACAPI_Element_GetDefaultsExt and ACAPI_Element_ChangeDefaultsExt functions. You can enumerate the drawing primitives of the Story Level lines of a given Section/Elevation database with the ACAPI_DrawingPrimitive_DrawStoryControl database function. From API 21 all 3 (main, depth, and marked distant) lines of a section segment can be "broken". The coordinates can be found in the element memo.
Member Data Documentation
◆ active
 API_SectionSegment::active
Turned off or active.
◆ begLine
 API_SectionSegment::begLine
Show line at beginning point.
◆ begMark
 API_SectionSegment::begMark
Put marker on the beginning point.
◆ begMarkerId
 API_SectionSegment::begMarkerId
Guid of the Section Marker object at the starting point of the section line.
◆ boundaryDisplay
 API_SectionSegment::boundaryDisplay
Boundary contour display mode. The possible values are: APIBound_UncutContours, APIBound_NoContours, and APIBound_OverrideContours.
◆ boundaryLineType
 API_SectionSegment::boundaryLineType
Boundary contour line type.
◆ boundaryPen
 API_SectionSegment::boundaryPen
Boundary contour pen.
◆ byLimitLines
 API_SectionSegment::byLimitLines
Relevant elems are detected only by limit lines (used only for Interior Elevation segments).
◆ continuous
 API_SectionSegment::continuous
Continuous if true, otherwise is segmented.
◆ currPlanConn
 API_SectionSegment::currPlanConn
Current plan connectivity (read only). Show the state of the Section/Elevation window. This member will pick up the value of intPlanConn when the Section/Elevation window was activated. The Section/Elevation will be regenerated from the model if it's necessary.
◆ cutPlIdStr
 API_SectionSegment::cutPlIdStr
The reference ID of the section in Unicode. If the text contains a '/' character, then the text is split between the beginning and end marks.
◆ cutPlName
 API_SectionSegment::cutPlName
Name of the section as a Unicode string.
◆ databaseID
 API_SectionSegment::databaseID
Database ID to switch to (see API_DatabaseUnId).
◆ distAreaElemPen
 API_SectionSegment::distAreaElemPen
Pen attribute index of elements in distant area of the Section/Elevation view.
◆ distAreaShadFill
 API_SectionSegment::distAreaShadFill
Fill attribute index for Shadow Polygons used in the Section/Elevation view.
◆ distAreaShadFillBGPen
 API_SectionSegment::distAreaShadFillBGPen
Fill background pen index for Shadow Polygons used in the Section/Elevation view.
◆ distAreaShadFillPen
 API_SectionSegment::distAreaShadFillPen
Fill pen index for Shadow Polygons used in the Section/Elevation view.
◆ distAreaUncutSurfBGPen
 API_SectionSegment::distAreaUncutSurfBGPen
Pencolor to apply to the fills of all uncut surfaces in the distant area of the Section/Elevation (if uniform pencolor is selected in the Distant Area Options).
◆ distAreaUncutSurfFillType
 API_SectionSegment::distAreaUncutSurfFillType
The method for displaying fills of uncut surfaces in the distant area of the Section/Elevation (effective if distAreaUseUncutSurfFill is true)
 API_CutPlaneUncutSurfaceFillID  | Meaning
 APICutPl_PenColor  | Apply uniform pencolor to the fills of all uncut surfaces
 APICutPl_MaterialColorShaded  | Display uncut fills using own material colors of the elements with shading
 APICutPl_MaterialColorNonShaded  | Display uncut fills using own material colors of the elements without shading
◆ distAreaUseElemPen
 API_SectionSegment::distAreaUseElemPen
Use one pen for all elements in distant area of the Section/Elevation view.
◆ distAreaUseUncutSurfFill
 API_SectionSegment::distAreaUseUncutSurfFill
Apply fills to uncut surfaces displayed in the distant area of the Section/Elevation.
◆ drawingModeON
 API_SectionSegment::drawingModeON
Section is in drawing mode.
◆ effectBits
 API_SectionSegment::effectBits
The settings of the 3D view. It can take the following values:
 Effect  | Meaning
 APICutPl_VectorHatch  | Create vectorial 3D hatching
 APICutPl_VectorShadow  | Create vectorial Sun shadows
 APICutPl_SunFrom3D  | The parameters of the Sun are the same as in the 3D window
◆ endLine
 API_SectionSegment::endLine
Show line at end point.
◆ endMark
 API_SectionSegment::endMark
Put marker on the end point.
◆ endMarkerId
 API_SectionSegment::endMarkerId
Guid of the Section Marker object at the end point of the section line.
◆ exclBlockWalls
 API_SectionSegment::exclBlockWalls
Exclude view blocking walls (for interior elevations only).
◆ font
 API_SectionSegment::font
Font attribute index for the marker text.
◆ horizRange
 API_SectionSegment::horizRange
Horizontal range of the segment:
 API_SegmentHorizontalRange  | Meaning
 APIHorRange_Infinite  | No limit on horizontal range.
 APIHorRange_Limited  | Limit the horizontal range.
 APIHorRange_ZeroDepth  | The depth of the section or elevation is 0.
◆ ieCreationSegmentDepth
 API_SectionSegment::ieCreationSegmentDepth
Used only for Interior Elevation creation.
◆ ieCreationSegmentHorizontalOffset
 API_SectionSegment::ieCreationSegmentHorizontalOffset
Used only for Interior Elevation creation.
◆ iePolygonEdge
 API_SectionSegment::iePolygonEdge
Used for link the segment to an edge of the Interior Elevation.
◆ intPlanConn
 API_SectionSegment::intPlanConn
Intended plan connectivity. Show the state of the element on the plan. It could be different from the state of its Section/Elevation window (currPlanConn).
◆ limitLinePen
 API_SectionSegment::limitLinePen
Line pen of the horizontal limit line.
◆ limitLtypeInd
 API_SectionSegment::limitLtypeInd
Line type of the horizontal limit line.
◆ lineLength
 API_SectionSegment::lineLength
Length of the line.
◆ linePen
 API_SectionSegment::linePen
Pen attribute index of the line.
◆ ltypeInd
 API_SectionSegment::ltypeInd
Line type attribute index.
◆ markedDistArea
 API_SectionSegment::markedDistArea
Mark distant area.
◆ markerSize
 API_SectionSegment::markerSize
Marker size.
◆ middleLine
 API_SectionSegment::middleLine
Show line at midlle point.
◆ midMarkerId
 API_SectionSegment::midMarkerId
Guid of the Section Marker object at the center point of the section line.
◆ modelElemPen
 API_SectionSegment::modelElemPen
Foreground pen of model uncut surface fill.
◆ modelUncutSurfBGPen
 API_SectionSegment::modelUncutSurfBGPen
Pencolor to apply to the fills of all uncut surfaces in the Section/Elevation (if uniform pencolor is selected in the Model Effects panel).
◆ modelUncutSurfFillType
 API_SectionSegment::modelUncutSurfFillType
The method for displaying fills of uncut surfaces (Model Effects) of the Section/Elevation (effective if modelUseUncutSurfFill is true). See the API_CutPlaneUncutSurfaceFillID values at the distAreaUncutSurfFillType parameter.
◆ modelUseElemPen
 API_SectionSegment::modelUseElemPen
Use one pen for all elements in the Section/Elevation view.
◆ modelUseUncutSurfFill
 API_SectionSegment::modelUseUncutSurfFill
Apply fills to uncut surfaces displayed in the Section/Elevation.
◆ nDepthCoord
 API_SectionSegment::nDepthCoord
Number of depth line coordinates in memo.
◆ nDistCoord
 API_SectionSegment::nDistCoord
Number of marked distant area line coordinates in memo.
◆ nMainCoord
 API_SectionSegment::nMainCoord
Number of main line coordinates in memo.
◆ relativeToStory
 API_SectionSegment::relativeToStory
Vertical limited range is relative to the home story or absolute to project zero.
◆ sectFillBGPen
 API_SectionSegment::sectFillBGPen
Pen attribute index of the background fill of the cut elements (when not overridden by useElemPens)
◆ sectFillPen
 API_SectionSegment::sectFillPen
Pen attribute index to be used in sections for fills (when not overridden by useElemPens)
◆ sectPen
 API_SectionSegment::sectPen
Pen attribute index to be used in sections for contours (when not overridden by useElemPens).
◆ shadFill
 API_SectionSegment::shadFill
Fill attribute index of the shadow's fill.
◆ shadFillBGPen
 API_SectionSegment::shadFillBGPen
Background pen attribute index of the shadow's fill.
◆ shadFillPen
 API_SectionSegment::shadFillPen
Pen attribute index of the shadow's fill.
◆ shAppearance
 API_SectionSegment::shAppearance
Options for displaying story lines on the Section/Elevation.
 API_StoryHandleAppearance  | Meaning
 APICutPl_SHANone  | Story lines are not displayed on the Section/Elevation
 APICutPl_SHADisplayOnly  | Story lines appear only on-screen, but are not displayed on the printed output
 APICutPl_SHAAll  | Story lines appear both on screen and on the printed output
◆ shLeftMarkerOffset
 API_SectionSegment::shLeftMarkerOffset
The offset of the Story Level line beyond the limits of the Section/Elevation on the left side.
◆ shLeftMarkerOn
 API_SectionSegment::shLeftMarkerOn
Display the Story Handle Markers on the left side.
◆ shLineOn
 API_SectionSegment::shLineOn
Story handle line is on or off.
◆ shLinePen
 API_SectionSegment::shLinePen
Pencolor index of the Story Level lines.
◆ shLineType
 API_SectionSegment::shLineType
Line type index of the Story Level lines.
◆ shMarkerFaceBits
 API_SectionSegment::shMarkerFaceBits
The text style of the Story Handle Marker.
◆ shMarkerFont
 API_SectionSegment::shMarkerFont
The font index of the Story Handle Marker.
◆ shMarkerPen
 API_SectionSegment::shMarkerPen
Pencolor index of the Story Handle Markers (effective when not overridden by shUseSymbolPens).
◆ shMarkerSize
 API_SectionSegment::shMarkerSize
The size of the Story Handle Marker in mm.
◆ shMarkerTextSize
 API_SectionSegment::shMarkerTextSize
The text size of the Story Handle Marker in mm.
◆ showCutElements
 API_SectionSegment::showCutElements
Show cut elements (for interior elevations only).
◆ shRightMarkerOffset
 API_SectionSegment::shRightMarkerOffset
The offset of the Story Level line beyond the limits of the Section/Elevation on the right side.
◆ shRightMarkerOn
 API_SectionSegment::shRightMarkerOn
Display the Story Handle Markers on the right side.
◆ shSymbolId
 API_SectionSegment::shSymbolId
The guid of the Story Handle Marker object element instance (API_ObjectType).
◆ shUseSymbolPens
 API_SectionSegment::shUseSymbolPens
Use own colors of the Story Handle Marker object.
◆ solidOperationsOnZones
 API_SectionSegment::solidOperationsOnZones
Use the solid operations on zones (for interior elevations only).
◆ sourceMarker
 API_SectionSegment::sourceMarker
Is this segment a source marker? (output only/no default)
◆ sunAngXY
 API_SectionSegment::sunAngXY
Custom sun azimuth relative to the cut plane.
◆ sunAngZ
 API_SectionSegment::sunAngZ
Custom sun altitude relative to the cut plane.
◆ textPen
 API_SectionSegment::textPen
Pen attribute index of the text.
◆ textSize
 API_SectionSegment::textSize
Text size [mm] of marker text.
◆ transparency
 bool API_SectionSegment::transparency
◆ useElemPens
 API_SectionSegment::useElemPens
Use the pens defined in the elements.
◆ verticalRangeStoryBaseNumber
 API_SectionSegment::verticalRangeStoryBaseNumber
The story number to which vertMin and vertMax is relative to, when relativeToStory is true.
◆ vertMax
 API_SectionSegment::vertMax
Vertical limitation - maximum height.
◆ vertMin
 API_SectionSegment::vertMin
Vertical limitation - minimum height.
◆ vertRange
 API_SectionSegment::vertRange
Vertical range of the segment:
 API_SegmentVerticalRange  | Meaning
 APIVerRange_Infinite  | No limit on vertical range.
 APIVerRange_Limited  | Limit the vertical range; the limits are in vertMin and vertMax
 APIVerRange_FitToZoneRange  | If a zone is present, then use the top and bottom level of the zone as a limit (for interior elevations only).
◆ windOpened
 API_SectionSegment::windOpened
The section/elevation/interior elevation window is opened.